---
kind: method
id: M:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.GetCurrentElements
source: html/b262877a-d1a8-145a-2aff-861e62304944.htm
---
# Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.GetCurrentElements Method

Returns the list of Ids of the current elements.

## Syntax (C#)
```csharp
public IList<ElementId> GetCurrentElements()
```

## Returns
Ids of the current elements. Contains the analytical model element to which the code checking parameter belongs.